ProgessBase/Catalogs/АП_НазначениеРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АП_НазначениеРезервов</Name>
			<Comment>Аналитика для общих резервов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированныйРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/InformationRegisters/КП_ФиксированныеРезервыПоНазначениюРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КП_ФиксированныеРезервыПоНазначениюРезервов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НазначениеРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АП_НазначениеРезервов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АП_НазначениеРезерва</Name>
					<Comment>Для общего резервирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.АП_НазначениеРезервов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/Catalogs/АП_НазначениеРезервов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Проверим чтобы были заполнены контрагенты, и чтобы контрагент был использован только в одном назначении
	Если Контрагенты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Заполните данные по контрагентам", Отказ);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	АП_НазначениеРезервовКонтрагенты.Ссылка
		               |ИЗ
		               |	Справочник.АП_НазначениеРезервов.Контрагенты КАК АП_НазначениеРезервовКонтрагенты
		               |ГДЕ
		               |	АП_НазначениеРезервовКонтрагенты.Ссылка.Отделение = &Отделение
		               |	И НЕ АП_НазначениеРезервовКонтрагенты.Ссылка = &Ссылка
		               |	И АП_НазначениеРезервовКонтрагенты.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Отделение", Отделение);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Для каждого СтрКонтрагент Из Контрагенты Цикл
		
			Запрос.УстановитьПараметр("Контрагент", СтрКонтрагент.Контрагент);	
			
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				//начало изменений Ожиганов 15.04.2015 37867 
				//ОбщегоНазначения.СообщитьОбОшибке("Контрагент/Склад: " + СокрЛП(СтрКонтрагент.Контрагент) + " уже указан в назначении резерва " + СокрЛП(Результат.Ссылка), Отказ);
				Сообщить("Контрагент/Склад: " + СокрЛП(СтрКонтрагент.Контрагент) + " уже указан в назначении резерва " + СокрЛП(Результат.Ссылка));
				//конец изменений 
			КонецЕсли;
		
		КонецЦикла; 
	КонецЕсли;
	
	Если Не Отказ И Не ЭтоНовый() Тогда
		Если Не ФиксированныйРезерв = Ссылка.ФиксированныйРезерв Тогда
			Отказ = Не МожноМенятьВидНазначения();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция МожноМенятьВидНазначения(ВыдаватьСообщение = Истина) Экспорт
	
	Если ЭтоНовый() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КП_ФиксированныеРезервыПоНазначениюРезервов.НазначениеРезерва
	               |ИЗ
	               |	РегистрСведений.КП_ФиксированныеРезервыПоНазначениюРезервов КАК КП_ФиксированныеРезервыПоНазначениюРезервов
	               |ГДЕ
	               |	КП_ФиксированныеРезервыПоНазначениюРезервов.НазначениеРезерва = &НазначениеРезерва
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТоварыВРезервеНаСкладах.АП_НазначениеРезерва
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
	               |ГДЕ
	               |	ТоварыВРезервеНаСкладах.АП_НазначениеРезерва = &НазначениеРезерва";
				   
     Запрос.УстановитьПараметр("НазначениеРезерва", Ссылка);
	 
	 Результат = Запрос.Выполнить().Пустой();
	 Если Результат Тогда
		 Возврат Истина;
	 Иначе
		 Если ВыдаватьСообщение Тогда
			 ОбщегоНазначения.СообщитьОбОшибке("Нельзя менять вид назначения резерва, потому что по нему уже выполнялось резервирование");
		 КонецЕсли;
		 
		 Если РольДоступна("АП_Администратор") Тогда
			 Возврат Истина;
		 Иначе
			 Возврат Ложь;
		 КонецЕсли;
	 Конецесли;
КонецФункции
